{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "20", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "20", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "20", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "50", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "50", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attr": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "50", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attr": {
        "kernel": "(2, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2_gamma", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_beta", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn2", 
      "attr": {
        "fix_gamma": "False", 
        "use_global_stats": "False"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 1], [12, 0, 1]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten_0", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ip1_weight", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "500"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ip1_bias", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "500"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "ip1", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "500"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ip2_weight", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "ip2_bias", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "ip2", 
      "attr": {
        "no_bias": "False", 
        "num_hidden": "10"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    9, 
    10, 
    11, 
    12, 
    15, 
    16, 
    19, 
    20, 
    22
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26
  ], 
  "heads": [[23, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 905]}
}